src/jcip/build_blocks.org
#+TITLE: 构建模块
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/main.css" />
#+OPTIONS: num:nil timestamp:nil
#+HTML_LINK_UP: composing_objects.html
#+HTML_LINK_HOME: jcip.html
* 同步集合类
  java提供了多种 *synchronized* 集合：
  + _Vector_ ,  _HashTable_
  + _Collections_ 的 _synchronizedXxx_ 方法的返回值.

  #+BEGIN_EXAMPLE
  这些集合封装了状态变量，对每个 public 方法添加 synchronized 关键字
  #+END_EXAMPLE

** 同步集合类的问题
   #+BEGIN_SRC java
      @NotThreadSafe
      public static Object getLast(Vector list) {   
              int lastIndex = list.size() - 1;   
              return list.get(lastIndex);   
      }   
        
      public static void deleteLast(Vector list) {   
              int lastIndex = list.size() - 1;   
              list.remove(lastIndex);   
      }  
   #+END_SRC
   #+BEGIN_EXAMPLE
     假设Vector对象中含有10个元素, 多线程环境下可能出现这样的场景: 

     1. 线程1调用getLast方法, 计算得知 lastIndex 为9
     2. 线程1失去CPU使用权
     3. 线程2调用deleteLast方法, 其lastIndex也为9
     4. 线程2删除了第9个元素
     5. 线程1重新获得CPU时间, 线程1会试图获取第9个元素, 但是该元素已经被线程2删除了, 此时将抛出ArrayIndexOutOfBoundsException异常
   #+END_EXAMPLE

   对于 _列表的复合操作_ 仍然需要 *额外的同步* 保证原子性
** ConcurrentModificationException　
   + 迭代集合时, 每个集合内部都拥有一个名为 _modCount_ 的成员变量, 如果集合发生了变化, 就会 *更改modCount的值* .
   + 使用 _Iterator_ 开始迭代时，会将modCount的赋值给 _expectedModCount_ 
     + 在迭代过程中, 通过 _每次比较两者是否相等_ 来判断集合 *是否在内部或被其它线程修改*
     + 如果 _expectedModCount和modCount不相等_ , 将抛出 *ConcurrentModificationException* 异常　

       #+BEGIN_SRC java
     Iterator<Integer> it = list.iterator();  
     while(it.hasNext()) {  
	     System.out.println(it.next());  
	     // remove操作会导致modCount的值被修改, 从而引发ConcurrentModificationException异常  
	     list.remove(0);  
     }  
       #+END_SRC

   + 可以使用 _并发集合类_
   + 先同步的 _clone一份集合_ 然后对 _clone集合进行迭代_ ,  *clone的过程仍然需要同步* 

   #+BEGIN_SRC java
  ArrayList<Integer> listClone = null;  
  // clone时依然需要同步  
  synchronized (list) {  
          listClone = (ArrayList<Integer>) list.clone();  
  }  
  Iterator<Integer> it = listClone.iterator();  
  while (it.hasNext()) {  
          doSomething(it.next());  
  }  
   #+END_SRC

* 并发集合类　
  - _ConcurrentHashMap_ 代替散列Map
  - _CopyOnWriteArrayList_ 代替同步List
  - _CopyOnWriteArraySet_ 代替同步Set
  - _ConcurrentSkipListMap_ 代替同步SortMap
  - _ConcurrentSkipListSet_ 代替同步SortSet

** ConcurrentHashMap
   + ConcurrentHashMap具有 *更好的并发性能* . ConcurrentHashMap是 *线程安全* 的, 但是其同步策略和SynchronizedMap有很大不同
     + ConcurrentHashMap在 _read_ 时 *几乎不用加锁*
     + _write_ 时使用的是 *细粒度的分段锁* ，甚至可以做到 *并发write* 
   + 由于ConcurrentHashMap的 _分段加锁机制_ , 使用时 *调用方无法再自行加锁* 
     + 因此ConcurrentHashMap类提供了一些常见的 _复合操作_

     #+BEGIN_SRC java
       // 只有key不是集合中的键时才插入该键值对
       V putIfAbsent(K key, V value); 
       // 集合中存在该键值对时才删除
       boolean remove(K key, V value); 
       // 只有key和oldValue是集合中的键值对是才进行替换
       boolean replace(K key, V oldValue, V newValue); 
       // 只有key是集合中的key时才进行替换
       V replace(K key, V newValue);
     #+END_SRC

   #+BEGIN_EXAMPLE
     迭代时不需要调用方进行额外的同步. ConcurrentHashMap使用的迭代器被称为weakly consistent(弱一致)迭代器,

     迭代开始后, 如果其他线程删除了ConcurrentHashMap集合的某个元素, 且被删除的元素尚未由next方法返回, 则该元素就不会被迭代器返回给调用方.
     如果迭代开始后其他线程往ConcurrentHashMap集合中插入了新的元素, 那么新的元素可能会也可能不会被返回给调用方.

     无论如何, 弱一致迭代器都保证不会将同一个元素多次返回给调用方，弱一致迭代器也不会在迭代期间抛出ConcurrentModificationException异常

     调用ConcurrentHashMap对象的size, isEmpty等方法时(这些方法是针对整体Map的操作), 性能比较差
     ConcurrentHashMap适合在要求高并发高性能的场合下使用, 在这些场景下, size或者isEmpty等方法用处不大, 这是可以接受的权衡
   #+END_EXAMPLE

