html/jcip/build_blocks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>构建模块</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="composing_objects.html"> UP </a>
 |
 <a accesskey="H" href="jcip.html"> HOME </a>
</div><div id="content">
<h1 class="title">构建模块</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2850cbb">同步集合类</a>
<ul>
<li><a href="#org43eb7a1">同步集合类的问题</a></li>
<li><a href="#orgd1fe883">ConcurrentModificationException　</a></li>
</ul>
</li>
<li><a href="#org5a38998">并发集合类　</a>
<ul>
<li><a href="#orgac64909">ConcurrentHashMap</a></li>
<li><a href="#orge0ffae0">CopyOnWriteArrayList</a></li>
</ul>
</li>
<li><a href="#org0e9ea86">BlockingQueue接口</a>
<ul>
<li><a href="#org2e14ec9">常见实现类</a></li>
<li><a href="#orgc7caf1b">生产消费模式　</a></li>
</ul>
</li>
<li><a href="#org4bdacf9">同步工具类</a>
<ul>
<li><a href="#orgf7f5453">CountDownLatch</a></li>
<li><a href="#org7808e10">FutureTask</a></li>
<li><a href="#org34caf79">Semphore</a></li>
<li><a href="#org489442c">Barrier</a></li>
</ul>
</li>
<li><a href="#org7e823fb">高效线程安全的缓存</a></li>
</ul>
</div>
</div>
<div id="outline-container-org2850cbb" class="outline-2">
<h2 id="org2850cbb">同步集合类</h2>
<div class="outline-text-2" id="text-org2850cbb">
<p>
java提供了多种 <b>synchronized</b> 集合：
</p>
<ul class="org-ul">
<li><span class="underline">Vector</span> ,  <span class="underline">HashTable</span></li>
<li><span class="underline">Collections</span> 的 <span class="underline">synchronizedXxx</span> 方法的返回值.</li>
</ul>

<pre class="example">
  这些集合封装了状态变量，对每个 public 方法添加 synchronized 关键字
</pre>
</div>

<div id="outline-container-org43eb7a1" class="outline-3">
<h3 id="org43eb7a1">同步集合类的问题</h3>
<div class="outline-text-3" id="text-org43eb7a1">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #ffd700;">@NotThreadSafe</span>
<span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #00bfff; font-weight: bold;">static</span> <span style="color: #98f5ff;">Object</span> <span style="color: #daa520; font-weight: bold;">getLast</span>(<span style="color: #98f5ff;">Vector</span> <span style="color: #4eee94;">list</span>) {   
    <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">lastIndex</span> = list.size() - 1;   
    <span style="color: #00bfff; font-weight: bold;">return</span> list.get(lastIndex);   
}   

<span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #00bfff; font-weight: bold;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520; font-weight: bold;">deleteLast</span>(<span style="color: #98f5ff;">Vector</span> <span style="color: #4eee94;">list</span>) {   
    <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">lastIndex</span> = list.size() - 1;   
    list.remove(lastIndex);   
}  
</pre>
</div>
<pre class="example">
假设Vector对象中含有10个元素, 多线程环境下可能出现这样的场景: 

1. 线程1调用getLast方法, 计算得知 lastIndex 为9
2. 线程1失去CPU使用权
3. 线程2调用deleteLast方法, 其lastIndex也为9
4. 线程2删除了第9个元素
5. 线程1重新获得CPU时间, 线程1会试图获取第9个元素, 但是该元素已经被线程2删除了, 此时将抛出ArrayIndexOutOfBoundsException异常
</pre>

<p>
对于 <span class="underline">列表的复合操作</span> 仍然需要 <b>额外的同步</b> 保证原子性
</p>
</div>
</div>
<div id="outline-container-orgd1fe883" class="outline-3">
<h3 id="orgd1fe883">ConcurrentModificationException　</h3>
<div class="outline-text-3" id="text-orgd1fe883">
<ul class="org-ul">
<li>迭代集合时, 每个集合内部都拥有一个名为 <span class="underline">modCount</span> 的成员变量, 如果集合发生了变化, 就会 <b>更改modCount的值</b> .</li>
<li>使用 <span class="underline">Iterator</span> 开始迭代时，会将modCount的赋值给 <span class="underline">expectedModCount</span> 
<ul class="org-ul">
<li>在迭代过程中, 通过 <span class="underline">每次比较两者是否相等</span> 来判断集合 <b>是否在内部或被其它线程修改</b></li>
<li><p>
如果 <span class="underline">expectedModCount和modCount不相等</span> , 将抛出 <b>ConcurrentModificationException</b> 异常　
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">Iterator</span>&lt;<span style="color: #98f5ff;">Integer</span>&gt; <span style="color: #4eee94;">it</span> = list.iterator();  
<span style="color: #00bfff; font-weight: bold;">while</span>(it.hasNext()) {  
    System.out.println(it.next());  
    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">remove&#25805;&#20316;&#20250;&#23548;&#33268;modCount&#30340;&#20540;&#34987;&#20462;&#25913;, &#20174;&#32780;&#24341;&#21457;ConcurrentModificationException&#24322;&#24120;  </span>
    list.remove(0);  
}  
</pre>
</div></li>
</ul></li>

<li>可以使用 <span class="underline">并发集合类</span></li>
<li>先同步的 <span class="underline">clone一份集合</span> 然后对 <span class="underline">clone集合进行迭代</span> ,  <b>clone的过程仍然需要同步</b></li>
</ul>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">ArrayList</span>&lt;<span style="color: #98f5ff;">Integer</span>&gt; <span style="color: #4eee94;">listClone</span> = <span style="color: #ffd700;">null</span>;  
<span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">clone&#26102;&#20381;&#28982;&#38656;&#35201;&#21516;&#27493;  </span>
<span style="color: #00bfff; font-weight: bold;">synchronized</span> (list) {  
    listClone = (<span style="color: #98f5ff;">ArrayList</span>&lt;<span style="color: #98f5ff;">Integer</span>&gt;) list.clone();  
}  
<span style="color: #98f5ff;">Iterator</span>&lt;<span style="color: #98f5ff;">Integer</span>&gt; <span style="color: #4eee94;">it</span> = listClone.iterator();  
<span style="color: #00bfff; font-weight: bold;">while</span> (it.hasNext()) {  
    doSomething(it.next());  
}  
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5a38998" class="outline-2">
<h2 id="org5a38998">并发集合类　</h2>
<div class="outline-text-2" id="text-org5a38998">
<ul class="org-ul">
<li><span class="underline">ConcurrentHashMap</span> 代替散列Map</li>
<li><span class="underline">CopyOnWriteArrayList</span> 代替同步List</li>
<li><span class="underline">CopyOnWriteArraySet</span> 代替同步Set</li>
<li><span class="underline">ConcurrentSkipListMap</span> 代替同步SortMap</li>
<li><span class="underline">ConcurrentSkipListSet</span> 代替同步SortSet</li>
</ul>
</div>

<div id="outline-container-orgac64909" class="outline-3">
<h3 id="orgac64909">ConcurrentHashMap</h3>
<div class="outline-text-3" id="text-orgac64909">
<ul class="org-ul">
<li>ConcurrentHashMap具有 <b>更好的并发性能</b> . ConcurrentHashMap是 <b>线程安全</b> 的, 但是其同步策略和SynchronizedMap有很大不同
<ul class="org-ul">
<li>ConcurrentHashMap在 <span class="underline">read</span> 时 <b>几乎不用加锁</b></li>
<li><span class="underline">write</span> 时使用的是 <b>细粒度的分段锁</b> ，甚至可以做到 <b>并发write</b></li>
</ul></li>
<li><p>
由于ConcurrentHashMap的 <span class="underline">分段加锁机制</span> , 使用时 <b>调用方无法再自行加锁</b> 
</p>
<ul class="org-ul">
<li>因此ConcurrentHashMap类提供了一些常见的 <span class="underline">复合操作</span></li>
</ul>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#21482;&#26377;key&#19981;&#26159;&#38598;&#21512;&#20013;&#30340;&#38190;&#26102;&#25165;&#25554;&#20837;&#35813;&#38190;&#20540;&#23545;</span>
<span style="color: #98f5ff;">V</span> <span style="color: #daa520; font-weight: bold;">putIfAbsent</span>(<span style="color: #98f5ff;">K</span> <span style="color: #4eee94;">key</span>, <span style="color: #98f5ff;">V</span> <span style="color: #4eee94;">value</span>); 
<span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#38598;&#21512;&#20013;&#23384;&#22312;&#35813;&#38190;&#20540;&#23545;&#26102;&#25165;&#21024;&#38500;</span>
<span style="color: #98f5ff;">boolean</span> <span style="color: #daa520; font-weight: bold;">remove</span>(<span style="color: #98f5ff;">K</span> <span style="color: #4eee94;">key</span>, <span style="color: #98f5ff;">V</span> <span style="color: #4eee94;">value</span>); 
<span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#21482;&#26377;key&#21644;oldValue&#26159;&#38598;&#21512;&#20013;&#30340;&#38190;&#20540;&#23545;&#26159;&#25165;&#36827;&#34892;&#26367;&#25442;</span>
<span style="color: #98f5ff;">boolean</span> <span style="color: #daa520; font-weight: bold;">replace</span>(<span style="color: #98f5ff;">K</span> <span style="color: #4eee94;">key</span>, <span style="color: #98f5ff;">V</span> <span style="color: #4eee94;">oldValue</span>, <span style="color: #98f5ff;">V</span> <span style="color: #4eee94;">newValue</span>); 
<span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#21482;&#26377;key&#26159;&#38598;&#21512;&#20013;&#30340;key&#26102;&#25165;&#36827;&#34892;&#26367;&#25442;</span>
<span style="color: #98f5ff;">V</span> <span style="color: #daa520; font-weight: bold;">replace</span>(<span style="color: #98f5ff;">K</span> <span style="color: #4eee94;">key</span>, <span style="color: #98f5ff;">V</span> <span style="color: #4eee94;">newValue</span>);
</pre>
</div></li>
</ul>

<pre class="example">
迭代时不需要调用方进行额外的同步. ConcurrentHashMap使用的迭代器被称为weakly consistent(弱一致)迭代器,

迭代开始后, 如果其他线程删除了ConcurrentHashMap集合的某个元素, 且被删除的元素尚未由next方法返回, 则该元素就不会被迭代器返回给调用方.
如果迭代开始后其他线程往ConcurrentHashMap集合中插入了新的元素, 那么新的元素可能会也可能不会被返回给调用方.

无论如何, 弱一致迭代器都保证不会将同一个元素多次返回给调用方，弱一致迭代器也不会在迭代期间抛出ConcurrentModificationException异常

调用ConcurrentHashMap对象的size, isEmpty等方法时(这些方法是针对整体Map的操作), 性能比较差
ConcurrentHashMap适合在要求高并发高性能的场合下使用, 在这些场景下, size或者isEmpty等方法用处不大, 这是可以接受的权衡
</pre>
</div>
</div>
