src/jcip/build_blocks.org
** CopyOnWriteArrayList 
   +  *线程安全* ：
     + _处理读操作_  *不需要进行同步和加锁* . 所以读操作具有很好的并发性
     + _每次写操作_ 都会把 *底层的数组进行拷贝* ，然后对拷贝数组进行修改，代价很高
   + *无法在调用方进行额外加锁* ：但也提供了一些常用的复合操作, 如 _putIfAbsent_ 等 

     #+BEGIN_SRC java
       // Insert into map only if no value is mapped from K
       V putIfAbsent(K key, V value);
       // Remove only if K is mapped to V
       boolean remove(K key, V value);
       // Replace value only if K is mapped to oldValue
       boolean replace(K key, V oldValue, V newValue);
       // Replace value only if K is mapped to some value
       V replace(K key, V newValue);
     #+END_SRC

   #+BEGIN_EXAMPLE
     CopyOnWriteArrayList的迭代只能反应迭代开始时所持有的集合.

     迭代期间不会抛出ConcurrentModificationException异常, 调用方不需要进行额外的加锁

     CopyOnWriteArrayList只适用于读操作频率远远大于写操作频率的场景
   #+END_EXAMPLE
* BlockingQueue接口 
  BlockingQueue的 *容量* 可以是 _无限的_ , 也可以是有限的. 无限容量的BlockingQueue *永远也不会发生队列已满的事件* 
  
  + _put_ 方法：用于 *将数据放入队列* 
    + 如果 _队列已满_ ,  _put方法所在的线程_ 将 *阻塞* , 直到队列不满 
  + _take_ 方法：用于从队列中 *取出数据* 
    + 如果 _队列为空_ ,  _take方法所在的线程_ 将 *阻塞* , 直到队列不为空 
  + _offer_ 方法：用于将 *数据放入队列* 
    + 如果 _队列已满_ , 将 *最多等待* _指定的时间_
    + 返回 _true_ ：说明 *数据成功入队* , 否则说明没有成功
  + _poll_ 方法：从队列中 *取出数据* 
    + 如果 _队列为空_ ,  *最多等待* _指定的时间_
    + 返回值为 _null_ ：说明 *没有取到数据*


** 常见实现类 
   + _ArrayBlockingQueue_ : 底层使用 *循环数组* 实现
   + _LinkedBlockingQueue_ : 底层使用 *链表* 实现
   + _PriorityBlockingQueue_ : 一个 *可排序* 的阻塞队列, 可以按照：
     + _元素的自然顺序_ ：元素需要实现 _Comparable_ 接口
     + 指定的 _Comparator_ 排序 
   + _SynchronousQueue_ ： *不用保存元素到Queue* ，直接交付给消费线程

** 生产消费模式　
   生产者
   #+BEGIN_SRC java
      public class FileCrawler implements Runnable {
              private final BlockingQueue<File> fileQueue;
              private final FileFilter fileFilter;
              private final File root;
              ...
              public void run() {
                      try {
                              crawl(root);
                      } catch (InterruptedException e) {
                              Thread.currentThread().interrupt();
                      }
              }
              private void crawl(File root) throws InterruptedException {
                      File[] entries = root.listFiles(fileFilter);
                      if (entries != null) {
                              for (File entry : entries)
                                      if (entry.isDirectory())
                                              crawl(entry);
                                      else if (!alreadyIndexed(entry))
                                              fileQueue.put(entry);
                      }
              }
      }

   #+END_SRC
   
   消费者
   #+BEGIN_SRC java
  public class Indexer implements Runnable {
          private final BlockingQueue<File> queue;
          public Indexer(BlockingQueue<File> queue) {
                  this.queue = queue;
          }
          public void run() {
                  try {
                          while (true)
                                  indexFile(queue.take());
                  } catch (InterruptedException e) {
                          Thread.currentThread().interrupt();
                  }
          }
  }
   #+END_SRC
   主线程
   #+BEGIN_SRC java
  public static void startIndexing(File[] roots) {
          BlockingQueue<File> queue = new LinkedBlockingQueue<File>(BOUND);
          FileFilter filter = new FileFilter() {
                          public boolean accept(File file) { return true; }
                  };
          for (File root : roots)
                  new Thread(new FileCrawler(queue, filter, root)).start();
          for (int i = 0; i < N_CONSUMERS; i++)
                  new Thread(new Indexer(queue)).start();
  }
   #+END_SRC
   
* 同步工具类
