html/jcip/build_blocks.html

<div id="outline-container-orge0ffae0" class="outline-3">
<h3 id="orge0ffae0">CopyOnWriteArrayList</h3>
<div class="outline-text-3" id="text-orge0ffae0">
<ul class="org-ul">
<li><b>线程安全</b> ：
<ul class="org-ul">
<li><span class="underline">处理读操作</span>  <b>不需要进行同步和加锁</b> . 所以读操作具有很好的并发性</li>
<li><span class="underline">每次写操作</span> 都会把 <b>底层的数组进行拷贝</b> ，然后对拷贝数组进行修改，代价很高</li>
</ul></li>
<li><p>
<b>无法在调用方进行额外加锁</b> ：但也提供了一些常用的复合操作, 如 <span class="underline">putIfAbsent</span> 等 
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">Insert into map only if no value is mapped from K</span>
<span style="color: #98f5ff;">V</span> <span style="color: #daa520; font-weight: bold;">putIfAbsent</span>(<span style="color: #98f5ff;">K</span> <span style="color: #4eee94;">key</span>, <span style="color: #98f5ff;">V</span> <span style="color: #4eee94;">value</span>);
<span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">Remove only if K is mapped to V</span>
<span style="color: #98f5ff;">boolean</span> <span style="color: #daa520; font-weight: bold;">remove</span>(<span style="color: #98f5ff;">K</span> <span style="color: #4eee94;">key</span>, <span style="color: #98f5ff;">V</span> <span style="color: #4eee94;">value</span>);
<span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">Replace value only if K is mapped to oldValue</span>
<span style="color: #98f5ff;">boolean</span> <span style="color: #daa520; font-weight: bold;">replace</span>(<span style="color: #98f5ff;">K</span> <span style="color: #4eee94;">key</span>, <span style="color: #98f5ff;">V</span> <span style="color: #4eee94;">oldValue</span>, <span style="color: #98f5ff;">V</span> <span style="color: #4eee94;">newValue</span>);
<span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">Replace value only if K is mapped to some value</span>
<span style="color: #98f5ff;">V</span> <span style="color: #daa520; font-weight: bold;">replace</span>(<span style="color: #98f5ff;">K</span> <span style="color: #4eee94;">key</span>, <span style="color: #98f5ff;">V</span> <span style="color: #4eee94;">newValue</span>);
</pre>
</div></li>
</ul>

<pre class="example">
CopyOnWriteArrayList的迭代只能反应迭代开始时所持有的集合.

迭代期间不会抛出ConcurrentModificationException异常, 调用方不需要进行额外的加锁

CopyOnWriteArrayList只适用于读操作频率远远大于写操作频率的场景
</pre>
</div>
</div>
</div>
<div id="outline-container-org0e9ea86" class="outline-2">
<h2 id="org0e9ea86">BlockingQueue接口</h2>
<div class="outline-text-2" id="text-org0e9ea86">
<p>
BlockingQueue的 <b>容量</b> 可以是 <span class="underline">无限的</span> , 也可以是有限的. 无限容量的BlockingQueue <b>永远也不会发生队列已满的事件</b> 
</p>

<ul class="org-ul">
<li><span class="underline">put</span> 方法：用于 <b>将数据放入队列</b> 
<ul class="org-ul">
<li>如果 <span class="underline">队列已满</span> ,  <span class="underline">put方法所在的线程</span> 将 <b>阻塞</b> , 直到队列不满</li>
</ul></li>
<li><span class="underline">take</span> 方法：用于从队列中 <b>取出数据</b> 
<ul class="org-ul">
<li>如果 <span class="underline">队列为空</span> ,  <span class="underline">take方法所在的线程</span> 将 <b>阻塞</b> , 直到队列不为空</li>
</ul></li>
<li><span class="underline">offer</span> 方法：用于将 <b>数据放入队列</b> 
<ul class="org-ul">
<li>如果 <span class="underline">队列已满</span> , 将 <b>最多等待</b> <span class="underline">指定的时间</span></li>
<li>返回 <span class="underline">true</span> ：说明 <b>数据成功入队</b> , 否则说明没有成功</li>
</ul></li>
<li><span class="underline">poll</span> 方法：从队列中 <b>取出数据</b> 
<ul class="org-ul">
<li>如果 <span class="underline">队列为空</span> ,  <b>最多等待</b> <span class="underline">指定的时间</span></li>
<li>返回值为 <span class="underline">null</span> ：说明 <b>没有取到数据</b></li>
</ul></li>
</ul>
</div>


<div id="outline-container-org2e14ec9" class="outline-3">
<h3 id="org2e14ec9">常见实现类</h3>
<div class="outline-text-3" id="text-org2e14ec9">
<ul class="org-ul">
<li><span class="underline">ArrayBlockingQueue</span> : 底层使用 <b>循环数组</b> 实现</li>
<li><span class="underline">LinkedBlockingQueue</span> : 底层使用 <b>链表</b> 实现</li>
<li><span class="underline">PriorityBlockingQueue</span> : 一个 <b>可排序</b> 的阻塞队列, 可以按照：
<ul class="org-ul">
<li><span class="underline">元素的自然顺序</span> ：元素需要实现 <span class="underline">Comparable</span> 接口</li>
<li>指定的 <span class="underline">Comparator</span> 排序</li>
</ul></li>
<li><span class="underline">SynchronousQueue</span> ： <b>不用保存元素到Queue</b> ，直接交付给消费线程</li>
</ul>
</div>
</div>

<div id="outline-container-orgc7caf1b" class="outline-3">
<h3 id="orgc7caf1b">生产消费模式　</h3>
<div class="outline-text-3" id="text-orgc7caf1b">
<p>
生产者
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">FileCrawler</span> <span style="color: #00bfff; font-weight: bold;">implements</span> <span style="color: #98f5ff;">Runnable</span> {
    <span style="color: #00bfff; font-weight: bold;">private</span> <span style="color: #00bfff; font-weight: bold;">final</span> <span style="color: #98f5ff;">BlockingQueue</span>&lt;<span style="color: #98f5ff;">File</span>&gt; <span style="color: #4eee94;">fileQueue</span>;
    <span style="color: #00bfff; font-weight: bold;">private</span> <span style="color: #00bfff; font-weight: bold;">final</span> <span style="color: #98f5ff;">FileFilter</span> <span style="color: #4eee94;">fileFilter</span>;
    <span style="color: #00bfff; font-weight: bold;">private</span> <span style="color: #00bfff; font-weight: bold;">final</span> <span style="color: #98f5ff;">File</span> <span style="color: #4eee94;">root</span>;
    ...
    <span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #98f5ff;">void</span> run() {
        <span style="color: #00bfff; font-weight: bold;">try</span> {
            crawl(root);
        } <span style="color: #00bfff; font-weight: bold;">catch</span> (<span style="color: #98f5ff;">InterruptedException</span> <span style="color: #4eee94;">e</span>) {
            Thread.currentThread().interrupt();
        }
    }
    <span style="color: #00bfff; font-weight: bold;">private</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520; font-weight: bold;">crawl</span>(<span style="color: #98f5ff;">File</span> <span style="color: #4eee94;">root</span>) <span style="color: #00bfff; font-weight: bold;">throws</span> <span style="color: #98f5ff;">InterruptedException</span> {
        <span style="color: #98f5ff;">File</span>[] <span style="color: #4eee94;">entries</span> = root.listFiles(fileFilter);
        <span style="color: #00bfff; font-weight: bold;">if</span> (entries != <span style="color: #ffd700;">null</span>) {
            <span style="color: #00bfff; font-weight: bold;">for</span> (<span style="color: #98f5ff;">File</span> <span style="color: #4eee94;">entry</span> : entries)
                <span style="color: #00bfff; font-weight: bold;">if</span> (entry.isDirectory())
                    crawl(entry);
                <span style="color: #00bfff; font-weight: bold;">else</span> <span style="color: #00bfff; font-weight: bold;">if</span> (!alreadyIndexed(entry))
                    fileQueue.put(entry);
        }
    }
}

</pre>
</div>

<p>
消费者
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">Indexer</span> <span style="color: #00bfff; font-weight: bold;">implements</span> <span style="color: #98f5ff;">Runnable</span> {
    <span style="color: #00bfff; font-weight: bold;">private</span> <span style="color: #00bfff; font-weight: bold;">final</span> <span style="color: #98f5ff;">BlockingQueue</span>&lt;<span style="color: #98f5ff;">File</span>&gt; <span style="color: #4eee94;">queue</span>;
    <span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #daa520; font-weight: bold;">Indexer</span>(<span style="color: #98f5ff;">BlockingQueue</span>&lt;<span style="color: #98f5ff;">File</span>&gt; <span style="color: #4eee94;">queue</span>) {
        <span style="color: #00bfff; font-weight: bold;">this</span>.queue = queue;
    }
    <span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520; font-weight: bold;">run</span>() {
        <span style="color: #00bfff; font-weight: bold;">try</span> {
            <span style="color: #00bfff; font-weight: bold;">while</span> (<span style="color: #ffd700;">true</span>)
                indexFile(queue.take());
        } <span style="color: #00bfff; font-weight: bold;">catch</span> (<span style="color: #98f5ff;">InterruptedException</span> <span style="color: #4eee94;">e</span>) {
            Thread.currentThread().interrupt();
        }
    }
}
</pre>
</div>
<p>
主线程
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #00bfff; font-weight: bold;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520; font-weight: bold;">startIndexing</span>(<span style="color: #98f5ff;">File</span>[] <span style="color: #4eee94;">roots</span>) {
    <span style="color: #98f5ff;">BlockingQueue</span>&lt;<span style="color: #98f5ff;">File</span>&gt; <span style="color: #4eee94;">queue</span> = <span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">LinkedBlockingQueue</span>&lt;<span style="color: #98f5ff;">File</span>&gt;(BOUND);
    <span style="color: #98f5ff;">FileFilter</span> <span style="color: #4eee94;">filter</span> = <span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">FileFilter</span>() {
            <span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #98f5ff;">boolean</span> accept(<span style="color: #98f5ff;">File</span> <span style="color: #4eee94;">file</span>) { <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #ffd700;">true</span>; }
        };
    <span style="color: #00bfff; font-weight: bold;">for</span> (<span style="color: #98f5ff;">File</span> <span style="color: #4eee94;">root</span> : roots)
        <span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">Thread</span>(<span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">FileCrawler</span>(queue, filter, root)).start();
    <span style="color: #00bfff; font-weight: bold;">for</span> (<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">i</span> = 0; i &lt; <span style="color: #98f5ff;">N_CONSUMERS</span>; i++)
        <span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">Thread</span>(<span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">Indexer</span>(queue)).start();
}
</pre>
</div>
</div>
</div>
</div>
