src/jcip/build_blocks.org
** CountDownLatch
   *闭锁* 相当于一个门,  当 _到达特定的状态_ 之前, 门是 *关闭* 的, 此时所有线程将被 *阻塞* , 只有到达了特定状态, 线程才能通过
   1. 计算 _直到所有的资源初始化_ 才开始计算
   2. 服务 _直到依赖的服务启动完毕_ 才启动
   3. 会话 _直到所有的参加者都就绪_ 才开始

   #+BEGIN_EXAMPLE
     CountDownLatch是闭锁的具体实现：

     内部维护了一个计数器, 初始化CountDownLatch时需要指定计数器的初始值，该初始值表示需要等待完成的事件的个数

     每调用一次countDown方法, 表示其中一个事件已经完成, 计数器的值将减一

     当计数器减为0时, 门才会打开
   #+END_EXAMPLE

   #+BEGIN_SRC java
  public long timeTasks(int nThreads, final Runnable task)
          throws InterruptedException {
          // startGate用来控制子线程，当所有的子线程准备就绪时候，主线程执行startGate的countDown操作，让子线程一起运行
          final CountDownLatch startGate = new CountDownLatch(1);
          //endGate用来控制主线程，每个子线程运行完毕后，对endGate执行countDown操作，当所有的子线程结束后，主线程恢复运行
          final CountDownLatch endGate = new CountDownLatch(nThreads);
          for (int i = 0; i < nThreads; i++) {
                  Thread t = new Thread() {
                                  @Override
                                  public void run() {
                                          try {
                                                  //n个线程通过start gate处于等待状态
                                                  startGate.await();
                                                  try {
                                                          task.run();
                                                  } finally {
                                                          endGate.countDown();
                                                  }
                                          } catch (InterruptedException ignored) {
                                          }
                                  }
                          };
                  t.start();
          }
          long start = System.nanoTime();
          //start gate开启，n个线程同时开始运行
          startGate.countDown();
          
          endGate.await();
          long end = System.nanoTime();
          return end - start;
  }
   #+END_SRC
