html/jcip/build_blocks.html

<div id="outline-container-org4bdacf9" class="outline-2">
<h2 id="org4bdacf9">同步工具类</h2>
<div class="outline-text-2" id="text-org4bdacf9">
</div>
<div id="outline-container-orgf7f5453" class="outline-3">
<h3 id="orgf7f5453">CountDownLatch</h3>
<div class="outline-text-3" id="text-orgf7f5453">
<p>
<b>闭锁</b> 相当于一个门,  当 <span class="underline">到达特定的状态</span> 之前, 门是 <b>关闭</b> 的, 此时所有线程将被 <b>阻塞</b> , 只有到达了特定状态, 线程才能通过
</p>
<ol class="org-ol">
<li>计算 <span class="underline">直到所有的资源初始化</span> 才开始计算</li>
<li>服务 <span class="underline">直到依赖的服务启动完毕</span> 才启动</li>
<li>会话 <span class="underline">直到所有的参加者都就绪</span> 才开始</li>
</ol>

<pre class="example">
CountDownLatch是闭锁的具体实现：

内部维护了一个计数器, 初始化CountDownLatch时需要指定计数器的初始值，该初始值表示需要等待完成的事件的个数

每调用一次countDown方法, 表示其中一个事件已经完成, 计数器的值将减一

当计数器减为0时, 门才会打开
</pre>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #98f5ff;">long</span> <span style="color: #daa520; font-weight: bold;">timeTasks</span>(<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">nThreads</span>, <span style="color: #00bfff; font-weight: bold;">final</span> <span style="color: #98f5ff;">Runnable</span> <span style="color: #4eee94;">task</span>)
    <span style="color: #00bfff; font-weight: bold;">throws</span> <span style="color: #98f5ff;">InterruptedException</span> {
    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">startGate&#29992;&#26469;&#25511;&#21046;&#23376;&#32447;&#31243;&#65292;&#24403;&#25152;&#26377;&#30340;&#23376;&#32447;&#31243;&#20934;&#22791;&#23601;&#32490;&#26102;&#20505;&#65292;&#20027;&#32447;&#31243;&#25191;&#34892;startGate&#30340;countDown&#25805;&#20316;&#65292;&#35753;&#23376;&#32447;&#31243;&#19968;&#36215;&#36816;&#34892;</span>
    <span style="color: #00bfff; font-weight: bold;">final</span> <span style="color: #98f5ff;">CountDownLatch</span> <span style="color: #4eee94;">startGate</span> = <span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">CountDownLatch</span>(1);
    <span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">endGate&#29992;&#26469;&#25511;&#21046;&#20027;&#32447;&#31243;&#65292;&#27599;&#20010;&#23376;&#32447;&#31243;&#36816;&#34892;&#23436;&#27605;&#21518;&#65292;&#23545;endGate&#25191;&#34892;countDown&#25805;&#20316;&#65292;&#24403;&#25152;&#26377;&#30340;&#23376;&#32447;&#31243;&#32467;&#26463;&#21518;&#65292;&#20027;&#32447;&#31243;&#24674;&#22797;&#36816;&#34892;</span>
    <span style="color: #00bfff; font-weight: bold;">final</span> <span style="color: #98f5ff;">CountDownLatch</span> <span style="color: #4eee94;">endGate</span> = <span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">CountDownLatch</span>(nThreads);
    <span style="color: #00bfff; font-weight: bold;">for</span> (<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">i</span> = 0; i &lt; <span style="color: #98f5ff;">nThreads</span>; i++) {
        <span style="color: #98f5ff;">Thread</span> <span style="color: #4eee94;">t</span> = <span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">Thread</span>() {
                <span style="color: #ffd700;">@Override</span>
                <span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #98f5ff;">void</span> run() {
                    <span style="color: #00bfff; font-weight: bold;">try</span> {
                        <span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">n&#20010;&#32447;&#31243;&#36890;&#36807;start gate&#22788;&#20110;&#31561;&#24453;&#29366;&#24577;</span>
                        startGate.await();
                        <span style="color: #00bfff; font-weight: bold;">try</span> {
                            task.run();
                        } <span style="color: #00bfff; font-weight: bold;">finally</span> {
                            endGate.countDown();
                        }
                    } <span style="color: #00bfff; font-weight: bold;">catch</span> (<span style="color: #98f5ff;">InterruptedException</span> <span style="color: #4eee94;">ignored</span>) {
                    }
                }
            };
        t.start();
    }
    <span style="color: #98f5ff;">long</span> <span style="color: #4eee94;">start</span> = System.nanoTime();
    <span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">start gate&#24320;&#21551;&#65292;n&#20010;&#32447;&#31243;&#21516;&#26102;&#24320;&#22987;&#36816;&#34892;</span>
    startGate.countDown();

    endGate.await();
    <span style="color: #98f5ff;">long</span> <span style="color: #4eee94;">end</span> = System.nanoTime();
    <span style="color: #00bfff; font-weight: bold;">return</span> end - start;
}
</pre>
</div>
</div>
</div>
