src/jcip/build_blocks.org
** FutureTask
   *FutureTask* ：用于 *执行任务* 
   + 常用的构造函数 _FutureTask(Callable<V> callable)_ ：
     +  _Callable_ ： *封装任务* 
   +  _get_ 方法：返回任务的 *执行结果* 
   + 三种状态:  _等待运行_ ， _正在运行_ ， _已完成_ 
     + 处于 _已完成_ 状态时调用 _get_ 方法,  将 *立即返回计算结果* 
     + 否则 _get_ 方法会 *阻塞* , 直到FutureTask转变为 _已完成状态_ 
     + _计算完成_ ,  _抛出异常_ , 或者 _被取消_ 都会使得FutureTask的 *状态变为已完成* 
   
   #+BEGIN_EXAMPLE
     FutureTask的常见使用场景是封装一个耗时任务

     提前开始计算, 当需要计算结果时, 再调用其get方法

     这样可以减少等待计算完成的时间
   #+END_EXAMPLE   

   #+BEGIN_SRC java
  public class Preloader {
          private final FutureTask<ProductInfo> future =
                  new FutureTask<ProductInfo>(new Callable<ProductInfo>() {
                                  public ProductInfo call() throws DataLoadException {
                                          return loadProductInfo();
                                  }
                          });
          private final Thread thread = new Thread(future);
          public void start() { thread.start(); }
          public ProductInfo get()
                  throws DataLoadException, InterruptedException {
                  try {
  　　　　　　　　　　　　　　// get可能阻塞，获得计算结果，抛出异常                          
                          return future.get();
                  } catch (ExecutionException e) {
                          Throwable cause = e.getCause();
                          if (cause instanceof DataLoadException)
                                  throw (DataLoadException) cause; // 主线程直接处理业务异常
                          else
                                  throw launderThrowable(cause);
                  }
          }
  }
   #+END_SRC
   
   异常处理：
   1.  _业务异常_ ： *主线程* 处理
   2. _RuntimeException_ ：直接返回，然后在 *主线程抛出* 
   3. _Error_ ：直接抛出
   4. 抛出 _IllegalStateException_ 

      #+BEGIN_SRC java
	/** If the Throwable is an Error, throw it; if it is a
	 ,* RuntimeException return it, otherwise throw IllegalStateException
	 ,*/
	public static RuntimeException launderThrowable(Throwable t) {
		if (t instanceof RuntimeException)
			return (RuntimeException) t; // 返回RuntimeException，在主线程再次抛出
		else if (t instanceof Error)
			throw (Error) t; // 直接抛出Error
		else
			throw new IllegalStateException("Not unchecked", t);
	}
      #+END_SRC

** Semphore
   _Semaphore_ ：用于 *管理permit* 
   + 创建Semaphore对象时, 需要 *指定* permit的 _最大个数_
   + _acquire()_ 方法： 申请从Semaphore对象中 *获取一个permit* 
     + 如果当前semaphore对象 _没有可用的permit_ , 线程将被 *阻塞* , 直到 _有可用的_ permit
   + _release()_ 方法： *permit放回* Semaphore对象
   +  permit *不与线程绑定* , 一个线程申请的permit, 可以在另一个线程里release 
   #+BEGIN_EXAMPLE
     Semaphore 通常用于实现资源池这种有界的集合：如数据库连接池 等   

   #+END_EXAMPLE

   #+BEGIN_SRC java
  public class BoundedHashSet<T> {
          private final Set<T> set;
          private final Semaphore sem;

          public BoundedHashSet(int bound) {
                  this.set = Collections.synchronizedSet(new HashSet<>());
                  // 设定Semaphore对象中的permit的最大个数  
                  sem = new Semaphore(bound);
          }

          public boolean add(T o) throws InterruptedException {
                  // 每次add时就向semaphore对象申请一个permit  
                  sem.acquire();
                  boolean wasAdded = false;
                  try {
                          wasAdded = set.add(o);
                          return wasAdded;
                  } finally {
                          if (!wasAdded) {
                                  // set里已经存在元素时候release permit  
                                  sem.release();
                          }
                  }
          }

          public boolean remove(T o) {
                  boolean wasRemoved = set.remove(o);
                  if (wasRemoved) {
                          // 成功移除后将release permit 
                          sem.release();
                  }
                  return wasRemoved;
          }
  }
   #+END_SRC
   
