html/jcip/build_blocks.html
<div id="outline-container-org7808e10" class="outline-3">
<h3 id="org7808e10">FutureTask</h3>
<div class="outline-text-3" id="text-org7808e10">
<p>
<b>FutureTask</b> ：用于 <b>执行任务</b> 
</p>
<ul class="org-ul">
<li>常用的构造函数 <span class="underline">FutureTask(Callable&lt;V&gt; callable)</span> ：
<ul class="org-ul">
<li><span class="underline">Callable</span> ： <b>封装任务</b></li>
</ul></li>
<li><span class="underline">get</span> 方法：返回任务的 <b>执行结果</b></li>
<li>三种状态:  <span class="underline">等待运行</span> ， <span class="underline">正在运行</span> ， <span class="underline">已完成</span> 
<ul class="org-ul">
<li>处于 <span class="underline">已完成</span> 状态时调用 <span class="underline">get</span> 方法,  将 <b>立即返回计算结果</b></li>
<li>否则 <span class="underline">get</span> 方法会 <b>阻塞</b> , 直到FutureTask转变为 <span class="underline">已完成状态</span></li>
<li><span class="underline">计算完成</span> ,  <span class="underline">抛出异常</span> , 或者 <span class="underline">被取消</span> 都会使得FutureTask的 <b>状态变为已完成</b></li>
</ul></li>
</ul>

<pre class="example">
FutureTask的常见使用场景是封装一个耗时任务

提前开始计算, 当需要计算结果时, 再调用其get方法

这样可以减少等待计算完成的时间
</pre>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">Preloader</span> {
    <span style="color: #00bfff; font-weight: bold;">private</span> <span style="color: #00bfff; font-weight: bold;">final</span> <span style="color: #98f5ff;">FutureTask</span>&lt;<span style="color: #98f5ff;">ProductInfo</span>&gt; <span style="color: #4eee94;">future</span> =
        <span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">FutureTask</span>&lt;<span style="color: #98f5ff;">ProductInfo</span>&gt;(<span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">Callable</span>&lt;<span style="color: #98f5ff;">ProductInfo</span>&gt;() {
                <span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #98f5ff;">ProductInfo</span> <span style="color: #daa520; font-weight: bold;">call</span>() <span style="color: #00bfff; font-weight: bold;">throws</span> <span style="color: #98f5ff;">DataLoadException</span> {
                    <span style="color: #00bfff; font-weight: bold;">return</span> loadProductInfo();
                }
            });
    <span style="color: #00bfff; font-weight: bold;">private</span> <span style="color: #00bfff; font-weight: bold;">final</span> <span style="color: #98f5ff;">Thread</span> <span style="color: #4eee94;">thread</span> = <span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">Thread</span>(future);
    <span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520; font-weight: bold;">start</span>() { thread.start(); }
    <span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #98f5ff;">ProductInfo</span> <span style="color: #daa520; font-weight: bold;">get</span>()
        <span style="color: #00bfff; font-weight: bold;">throws</span> <span style="color: #98f5ff;">DataLoadException</span>, <span style="color: #98f5ff;">InterruptedException</span> {
        <span style="color: #00bfff; font-weight: bold;">try</span> {
&#12288;&#12288;&#12288;&#12288;&#12288;&#12288;&#12288;&#12288;&#12288;&#12288;&#12288;&#12288;&#12288;&#12288;<span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">get&#21487;&#33021;&#38459;&#22622;&#65292;&#33719;&#24471;&#35745;&#31639;&#32467;&#26524;&#65292;&#25243;&#20986;&#24322;&#24120;                          </span>
            <span style="color: #00bfff; font-weight: bold;">return</span> future.get();
        } <span style="color: #00bfff; font-weight: bold;">catch</span> (<span style="color: #98f5ff;">ExecutionException</span> <span style="color: #4eee94;">e</span>) {
            <span style="color: #98f5ff;">Throwable</span> <span style="color: #4eee94;">cause</span> = e.getCause();
            <span style="color: #00bfff; font-weight: bold;">if</span> (cause <span style="color: #00bfff; font-weight: bold;">instanceof</span> DataLoadException)
                <span style="color: #00bfff; font-weight: bold;">throw</span> (<span style="color: #98f5ff;">DataLoadException</span>) cause; <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#20027;&#32447;&#31243;&#30452;&#25509;&#22788;&#29702;&#19994;&#21153;&#24322;&#24120;</span>
            <span style="color: #00bfff; font-weight: bold;">else</span>
                <span style="color: #00bfff; font-weight: bold;">throw</span> launderThrowable(cause);
        }
    }
}
</pre>
</div>

<p>
异常处理：
</p>
<ol class="org-ol">
<li><span class="underline">业务异常</span> ： <b>主线程</b> 处理</li>
<li><span class="underline">RuntimeException</span> ：直接返回，然后在 <b>主线程抛出</b></li>
<li><span class="underline">Error</span> ：直接抛出</li>
<li><p>
抛出 <span class="underline">IllegalStateException</span> 
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #ffebcd;">/** If the Throwable is an Error, throw it; if it is a</span>
<span style="color: #ffebcd;"> * RuntimeException return it, otherwise throw IllegalStateException</span>
<span style="color: #ffebcd;"> */</span>
<span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #00bfff; font-weight: bold;">static</span> <span style="color: #98f5ff;">RuntimeException</span> <span style="color: #daa520; font-weight: bold;">launderThrowable</span>(<span style="color: #98f5ff;">Throwable</span> <span style="color: #4eee94;">t</span>) {
    <span style="color: #00bfff; font-weight: bold;">if</span> (t <span style="color: #00bfff; font-weight: bold;">instanceof</span> RuntimeException)
        <span style="color: #00bfff; font-weight: bold;">return</span> (<span style="color: #98f5ff;">RuntimeException</span>) t; <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#36820;&#22238;RuntimeException&#65292;&#22312;&#20027;&#32447;&#31243;&#20877;&#27425;&#25243;&#20986;</span>
    <span style="color: #00bfff; font-weight: bold;">else</span> <span style="color: #00bfff; font-weight: bold;">if</span> (t <span style="color: #00bfff; font-weight: bold;">instanceof</span> Error)
        <span style="color: #00bfff; font-weight: bold;">throw</span> (<span style="color: #98f5ff;">Error</span>) t; <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#30452;&#25509;&#25243;&#20986;Error</span>
    <span style="color: #00bfff; font-weight: bold;">else</span>
        <span style="color: #00bfff; font-weight: bold;">throw</span> <span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">IllegalStateException</span>(<span style="color: #deb887;">"Not unchecked"</span>, t);
}
</pre>
</div></li>
</ol>
</div>
</div>

<div id="outline-container-org34caf79" class="outline-3">
<h3 id="org34caf79">Semphore</h3>
<div class="outline-text-3" id="text-org34caf79">
<p>
<span class="underline">Semaphore</span> ：用于 <b>管理permit</b> 
</p>
<ul class="org-ul">
<li>创建Semaphore对象时, 需要 <b>指定</b> permit的 <span class="underline">最大个数</span></li>
<li><span class="underline">acquire()</span> 方法： 申请从Semaphore对象中 <b>获取一个permit</b> 
<ul class="org-ul">
<li>如果当前semaphore对象 <span class="underline">没有可用的permit</span> , 线程将被 <b>阻塞</b> , 直到 <span class="underline">有可用的</span> permit</li>
</ul></li>
<li><span class="underline">release()</span> 方法： <b>permit放回</b> Semaphore对象</li>
<li>permit <b>不与线程绑定</b> , 一个线程申请的permit, 可以在另一个线程里release</li>
</ul>
<pre class="example">
Semaphore 通常用于实现资源池这种有界的集合：如数据库连接池 等   

</pre>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">BoundedHashSet</span>&lt;<span style="color: #98f5ff;">T</span>&gt; {
    <span style="color: #00bfff; font-weight: bold;">private</span> <span style="color: #00bfff; font-weight: bold;">final</span> <span style="color: #98f5ff;">Set</span>&lt;<span style="color: #98f5ff;">T</span>&gt; <span style="color: #4eee94;">set</span>;
    <span style="color: #00bfff; font-weight: bold;">private</span> <span style="color: #00bfff; font-weight: bold;">final</span> <span style="color: #98f5ff;">Semaphore</span> <span style="color: #4eee94;">sem</span>;

    <span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #daa520; font-weight: bold;">BoundedHashSet</span>(<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">bound</span>) {
        <span style="color: #00bfff; font-weight: bold;">this</span>.set = Collections.synchronizedSet(<span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">HashSet</span>&lt;&gt;());
        <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#35774;&#23450;Semaphore&#23545;&#35937;&#20013;&#30340;permit&#30340;&#26368;&#22823;&#20010;&#25968;  </span>
        sem = <span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">Semaphore</span>(bound);
    }

    <span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #98f5ff;">boolean</span> <span style="color: #daa520; font-weight: bold;">add</span>(<span style="color: #98f5ff;">T</span> <span style="color: #4eee94;">o</span>) <span style="color: #00bfff; font-weight: bold;">throws</span> <span style="color: #98f5ff;">InterruptedException</span> {
        <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#27599;&#27425;add&#26102;&#23601;&#21521;semaphore&#23545;&#35937;&#30003;&#35831;&#19968;&#20010;permit  </span>
        sem.acquire();
        <span style="color: #98f5ff;">boolean</span> <span style="color: #4eee94;">wasAdded</span> = <span style="color: #ffd700;">false</span>;
        <span style="color: #00bfff; font-weight: bold;">try</span> {
            wasAdded = set.add(o);
            <span style="color: #00bfff; font-weight: bold;">return</span> wasAdded;
        } <span style="color: #00bfff; font-weight: bold;">finally</span> {
            <span style="color: #00bfff; font-weight: bold;">if</span> (!wasAdded) {
                <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">set&#37324;&#24050;&#32463;&#23384;&#22312;&#20803;&#32032;&#26102;&#20505;release permit  </span>
                sem.release();
            }
        }
    }

    <span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #98f5ff;">boolean</span> <span style="color: #daa520; font-weight: bold;">remove</span>(<span style="color: #98f5ff;">T</span> <span style="color: #4eee94;">o</span>) {
        <span style="color: #98f5ff;">boolean</span> <span style="color: #4eee94;">wasRemoved</span> = set.remove(o);
        <span style="color: #00bfff; font-weight: bold;">if</span> (wasRemoved) {
            <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#25104;&#21151;&#31227;&#38500;&#21518;&#23558;release permit </span>
            sem.release();
        }
        <span style="color: #00bfff; font-weight: bold;">return</span> wasRemoved;
    }
}
</pre>
</div>
</div>
</div>
