src/jcip/build_blocks.org
** Barrier
   #+BEGIN_EXAMPLE
     栅栏允许一组线程互相等待 , 直到该组线程全部到达某个公共屏障点

     闭锁：一组线程等待事件 
     栅栏 ： 一组线程互相等待其他线程　
   #+END_EXAMPLE

   _CyclicBarrier_ ：栅栏的 *一种实现* 
   + 创建CyclicBarrier时需要指定线程组中线程的数量
   + _await_ 方法：表示 _当前线程_ 已 *到达* _公共屏障点_ , 然后 *等待其他线程到达*
   + 当 _所有线程_ 到达 _公共屏障点_ 后, CyclicBarrier对象将 *释放线程组* , 然后 *重置*  _CyclicBarrier对象的状态_ 
     + 因此CyclicBarrier对象是可以 *循环使用* 的（闭锁的门一旦打开就不会再次关闭）
  + 如果 _有线程在等待期间_  *超时* 或者 *被中断* 
     + 该CyclicBarrier对象被视为 *已损坏* ，随后对 _await_ 方法的调用都要抛出 *BrokenBarrierException* 异常

   #+BEGIN_EXAMPLE
     栅栏可以用于计算中主线程等待另外一组线程并行计算完毕　
   #+END_EXAMPLE

   #+BEGIN_SRC java
  public class CellularAutomata {
          private final Board mainBoard;
          private final CyclicBarrier barrier;
          private final Worker[] workers;
          public CellularAutomata(Board board) {
                  this.mainBoard = board;
                  int count = Runtime.getRuntime().availableProcessors();
                  this.barrier = new CyclicBarrier(count,
                                                   new Runnable() {
                                                           public void run() {
                                                                   mainBoard.commitNewValues();
                                                           }});
                  this.workers = new Worker[count];
                  for (int i = 0; i < count; i++)
                          workers[i] = new Worker(mainBoard.getSubBoard(count, i));
          }
          private class Worker implements Runnable {
                  private final Board board;
                  public Worker(Board board) { this.board = board; }
                  public void run() {
                          while (!board.hasConverged()) {
                                  for (int x = 0; x < board.getMaxX(); x++)
                                          for (int y = 0; y < board.getMaxY(); y++)
                                                  board.setNewValue(x, y, computeValue(x, y));
                                  try {
                                          barrier.await();
                                  } catch (InterruptedException ex) {
                                          return;
                                  } catch (BrokenBarrierException ex) {
                                          return;
                                  }
                          }
                  }
          }
          public void start() {
                  for (int i = 0; i < workers.length; i++)
                          new Thread(workers[i]).start();
                  mainBoard.waitForConvergence();
          }
  }
   #+END_SRC
   　
