html/jcip/build_blocks.html

<div id="outline-container-org489442c" class="outline-3">
<h3 id="org489442c">Barrier</h3>
<div class="outline-text-3" id="text-org489442c">
<pre class="example">
     栅栏允许一组线程互相等待 , 直到该组线程全部到达某个公共屏障点

     闭锁：一组线程等待事件 
     栅栏 ： 一组线程互相等待其他线程　
</pre>

<p>
<span class="underline">CyclicBarrier</span> ：栅栏的 <b>一种实现</b> 
</p>
<ul class="org-ul">
<li>创建CyclicBarrier时需要指定线程组中线程的数量</li>
<li><span class="underline">await</span> 方法：表示 <span class="underline">当前线程</span> 已 <b>到达</b> <span class="underline">公共屏障点</span> , 然后 <b>等待其他线程到达</b></li>
<li>当 <span class="underline">所有线程</span> 到达 <span class="underline">公共屏障点</span> 后, CyclicBarrier对象将 <b>释放线程组</b> , 然后 <b>重置</b>  <span class="underline">CyclicBarrier对象的状态</span> 
<ul class="org-ul">
<li>因此CyclicBarrier对象是可以 <b>循环使用</b> 的（闭锁的门一旦打开就不会再次关闭）</li>
</ul></li>
</ul>
<ul class="org-ul">
<li><p>
如果 <span class="underline">有线程在等待期间</span>  <b>超时</b> 或者 <b>被中断</b> 
</p>
<ul class="org-ul">
<li>该CyclicBarrier对象被视为 <b>已损坏</b> ，随后对 <span class="underline">await</span> 方法的调用都要抛出 <b>BrokenBarrierException</b> 异常</li>
</ul>

<pre class="example">
     栅栏可以用于计算中主线程等待另外一组线程并行计算完毕　
</pre>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">CellularAutomata</span> {
    <span style="color: #00bfff; font-weight: bold;">private</span> <span style="color: #00bfff; font-weight: bold;">final</span> <span style="color: #98f5ff;">Board</span> <span style="color: #4eee94;">mainBoard</span>;
    <span style="color: #00bfff; font-weight: bold;">private</span> <span style="color: #00bfff; font-weight: bold;">final</span> <span style="color: #98f5ff;">CyclicBarrier</span> <span style="color: #4eee94;">barrier</span>;
    <span style="color: #00bfff; font-weight: bold;">private</span> <span style="color: #00bfff; font-weight: bold;">final</span> <span style="color: #98f5ff;">Worker</span>[] <span style="color: #4eee94;">workers</span>;
    <span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #daa520; font-weight: bold;">CellularAutomata</span>(<span style="color: #98f5ff;">Board</span> <span style="color: #4eee94;">board</span>) {
        <span style="color: #00bfff; font-weight: bold;">this</span>.mainBoard = board;
        <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">count</span> = Runtime.getRuntime().availableProcessors();
        <span style="color: #00bfff; font-weight: bold;">this</span>.barrier = <span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">CyclicBarrier</span>(count,
                         <span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">Runnable</span>() {
                             <span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520; font-weight: bold;">run</span>() {
                                 mainBoard.commitNewValues();
                             }});
        <span style="color: #00bfff; font-weight: bold;">this</span>.workers = <span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">Worker</span>[count];
        <span style="color: #00bfff; font-weight: bold;">for</span> (<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">i</span> = 0; i &lt; <span style="color: #98f5ff;">count</span>; i++)
            workers[i] = <span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">Worker</span>(mainBoard.getSubBoard(count, i));
    }
    <span style="color: #00bfff; font-weight: bold;">private</span> <span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">Worker</span> <span style="color: #00bfff; font-weight: bold;">implements</span> <span style="color: #98f5ff;">Runnable</span> {
        <span style="color: #00bfff; font-weight: bold;">private</span> <span style="color: #00bfff; font-weight: bold;">final</span> <span style="color: #98f5ff;">Board</span> <span style="color: #4eee94;">board</span>;
        <span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #daa520; font-weight: bold;">Worker</span>(<span style="color: #98f5ff;">Board</span> <span style="color: #4eee94;">board</span>) { <span style="color: #00bfff; font-weight: bold;">this</span>.board = board; }
        <span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520; font-weight: bold;">run</span>() {
            <span style="color: #00bfff; font-weight: bold;">while</span> (!board.hasConverged()) {
                <span style="color: #00bfff; font-weight: bold;">for</span> (<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">x</span> = 0; x &lt; board.<span style="color: #98f5ff;">getMaxX</span>(); x++)
                    <span style="color: #00bfff; font-weight: bold;">for</span> (<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">y</span> = 0; y &lt; board.<span style="color: #98f5ff;">getMaxY</span>(); y++)
                        board.setNewValue(x, y, computeValue(x, y));
                <span style="color: #00bfff; font-weight: bold;">try</span> {
                    barrier.await();
                } <span style="color: #00bfff; font-weight: bold;">catch</span> (<span style="color: #98f5ff;">InterruptedException</span> <span style="color: #4eee94;">ex</span>) {
                    <span style="color: #00bfff; font-weight: bold;">return</span>;
                } <span style="color: #00bfff; font-weight: bold;">catch</span> (<span style="color: #98f5ff;">BrokenBarrierException</span> <span style="color: #4eee94;">ex</span>) {
                    <span style="color: #00bfff; font-weight: bold;">return</span>;
                }
            }
        }
    }
    <span style="color: #00bfff; font-weight: bold;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520; font-weight: bold;">start</span>() {
        <span style="color: #00bfff; font-weight: bold;">for</span> (<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">i</span> = 0; i &lt; workers.<span style="color: #98f5ff;">length</span>; i++)
            <span style="color: #00bfff; font-weight: bold;">new</span> <span style="color: #98f5ff;">Thread</span>(workers[i]).start();
        mainBoard.waitForConvergence();
    }
}
</pre>
</div>
<p>
　
</p></li>
</ul>
</div>
</div>
</div>
